{
  "auto_mapping": null,
  "base_model_name_or_path": "unsloth/Qwen2.5-1.5B-Instruct",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_v_bound": 0.02,
  "init_weights": true,
  "layers_pattern": null,
  "layers_to_transform": null,
  "modules_to_save": null,
  "peft_type": "TINYLORA",
  "peft_version": "0.19.1",
  "projection_seed": 3407,
  "r": 2,
  "revision": null,
  "save_projection": true,
  "target_modules": [
    "gate_proj",
    "q_proj",
    "up_proj",
    "k_proj",
    "down_proj",
    "o_proj",
    "v_proj"
  ],
  "task_type": "CAUSAL_LM",
  "tinylora_dropout": 0.0,
  "u": 64,
  "weight_tying": 0.0
}