{
  "auto_mapping": null,
  "base_model_name_or_path": "unsloth/Qwen2.5-3B-Instruct",
  "bias": "none",
  "delora_lambda": 15,
  "exclude_modules": null,
  "inference_mode": true,
  "init_weights": true,
  "lambda_pattern": {},
  "layers_pattern": null,
  "layers_to_transform": null,
  "module_dropout": 0.05,
  "modules_to_save": null,
  "peft_type": "DELORA",
  "peft_version": "0.19.1",
  "r": 16,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "v_proj",
    "down_proj",
    "o_proj",
    "gate_proj",
    "k_proj",
    "q_proj",
    "up_proj"
  ],
  "task_type": "CAUSAL_LM"
}